Revit 2027 API
DocumentCreatingEventArgs.Template Property
 The template file path to be used for creating the new document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Template { get; }
Public ReadOnly Property Template As String
	Get
public:
property String^ Template {
	String^ get ();
}
member Template : string with get
Property Value
String
See Also
Reference
DocumentCreatingEventArgs Class
Autodesk.Revit.DB.Events Namespace